Update ARCHITECTURE.md
